In [2]:
import pandas as pd
import numpy as np

# 데이터프레임 고급 인덱싱

- loc : 라벨값 기반의 2차원 인덱싱
- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

## loc indexer

df.loc[행 인덱싱 값]

df.loc[행 인덱싱 값, 열 인덱싱 값]

In [4]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), index = ['a', 'b', 'c'], columns=  ['A', 'B', 'C', 'D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

### 인덱싱 값을 하나만 받는 경우

In [5]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [6]:
df.loc['b':'c'] # loc을 안 쓴 결과와 같다.

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [7]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [9]:
df.loc[['b', 'c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [10]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [11]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [12]:
def select_rows(df):
    return df.A > 15

In [13]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [14]:
df.loc[select_rows]

    A   B   C   D
c  18  19  20  21

In [15]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns= ['A', 'B', 'C', 'D'])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [16]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

## 인덱싱 값을 행과 열 모두 받는 경우

In [19]:
df2.loc[1:, 'A']

1    14
2    18
3    22
Name: A, dtype: int64

In [20]:
df2.loc[0, :]

A    10
B    11
C    12
D    13
Name: 0, dtype: int64

In [21]:
df2.loc[[0, 1], ['B', 'D']]

    B   D
0  11  13
1  15  17

In [24]:
df2.loc[df2.A > 10, ['C', 'D']]

    C   D
1  16  17
2  20  21
3  24  25

## iloc indexer

In [26]:
df2.iloc[0, 1]

11

In [29]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int64

In [30]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [36]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int64

In [37]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [38]:
df = pd.DataFrame(np.arange(1, 26).reshape(5, 5), index = ['A', 'B', 'C', 'D', 'E'], columns= ['a', 'b', 'c', 'd', 'e'])
df

    a   b   c   d   e
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [41]:
df[:1]['a']

A    1
Name: a, dtype: int64

In [42]:
df.loc['A', 'a']

1

In [43]:
df.iloc[0, 0]

1